// js/daily-questions.js
const dailyQuestions = [
    {
        id: 16,
        q: "من خَصائصِ النَّبيِّ ﷺ التي وَرَدت فِي أوَّل سورة الفرقان:",
        link: "https://www.dorar.net/tafseer/25/1#tt4",
        answers: [
            {
                answer: "وُجوبُ قِيامِ اللَّيْل عَليهِ",
                t: 0,
            },
            {
                answer: "تَنامُ عَينُه ولا يَنامُ قَلبُه",
                t: 0,
            },
            {
                answer: "بعثَتُه إلى العالمين: الجنِّ والإنسِ",
                t: 1,
            },
        ],
        category: "التفسير",
        topic: "الفرقان",
    },
    {
        id: 18,
        q: "وَقفُ الإنسانِ عَلى نَفسِه",
        link: "https://www.dorar.net/feqhia/6007",
        answers: [
            {
                answer: "يَصِحُّ",
                t: 1,
            },
            {
                answer: "لا يَصِحُّ",
                t: 0,
            },
            {
                answer: "لا مَعنَى له",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "الوقف",
    },
    {
        id: 2,
        q: "الوَفاءُ بنَذرِ القُربةِ",
        link: "https://www.dorar.net/feqhia/5786",
        answers: [
            {
                answer: "مَكروهٌ",
                t: 0,
            },
            {
                answer: "واجِبٌ",
                t: 1,
            },
            {
                answer: "مُستحَبٌّ",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "الأيمان والنذور",
    },
    {
        id: 5,
        q: "إذا طلَّق الرجُلُ امرأتَه في وقت حيْضِها أو في طُهرٍ جامعَها فيه:",
        link: "https://www.dorar.net/feqhia/4553/المطلب-الأول:-حكم-طلاق-الحائض-والطَّلاق-في-طهر-جامعها-فيه",
        answers: [
            {
                answer: "فهو طلاقٌ سُنِّي",
                t: 0,
            },
            {
                answer: "فهو طلاقٌ محرَّمٌ",
                t: 1,
            },
            {
                answer: "ليس بطَلاقٍ",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "الطلاق",
    },
    {
        id: 16,
        q: "كان من هَديِ النَّبيِّ ﷺ أنَّه لا يَعجَلُ بالدُّعاءِ على أحَدٍ ما دامَ:",
        link: "https://dorar.net/hadith/sharh/14530",
        answers: [
            {
                answer: "لم يَغدِر",
                t: 0,
            },
            {
                answer: "يُحسِنُ ذِكرَه",
                t: 0,
            },
            {
                answer: "يَطمَعُ في إجابَتِهم إلى الإسلامِ",
                t: 1,
            },
        ],
        category: "الحديث",
        topic: "الاختبار الرابع",
    },
    {
        id: 17,
        q: "المُرادُ بقَولِه ﷺ: «بُعِثتُ بين يَدَيِ السَّاعةِ بالسَّيفِ»",
        link: "https://dorar.net/hadith/sharh/92122",
        answers: [
            {
                answer: "السَّيفُ المَقصُودُ هنا هو القُرآنُ، وهو مُعجِزتُه الباقِيَة ﷺ",
                t: 0,
            },
            {
                answer: "أنَّ مِن عَلاماتِ السَّاعَة انتِشارَ السَّيفِ؛ أي: القَتل",
                t: 0,
            },
            {
                answer: "أنَّه ﷺ بُعِثَ بالجِهادِ؛ لنَشرِ تَوحيدِ اللهِ وعِبادتِه دون شَريكٍ",
                t: 1,
            },
        ],
        category: "الحديث",
        topic: "الاختبار السابع",
    },
    {
        id: 20,
        q: "مَنعُ الحَملِ الدَّائمُ",
        link: "https://www.dorar.net/feqhia/4466",
        answers: [
            {
                answer: "يجوزُ مُطلقًا",
                t: 0,
            },
            {
                answer: "يجوزُ للضَّرورةِ فحسبُ",
                t: 1,
            },
            {
                answer: "لا يجوزُ مُطلقًا",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "النكاح",
    },
    {
        id: 8,
        q: "أكلُ لَحمِ الدَّجاجِ",
        link: "https://www.dorar.net/feqhia/3474/المطلب-الأول:-الدجاج",
        answers: [
            {
                answer: "مَكروهٌ",
                t: 0,
            },
            {
                answer: "حَلالٌ بالإجماعِ",
                t: 1,
            },
            {
                answer: "مُختَلَفٌ فيه",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "الأطعمة والأشربة",
    },
    {
        id: 8,
        q: "إذا تَسبَّبت المرأةُ في الفُرقة قبلَ الدخولِ:",
        link: "https://www.dorar.net/feqhia/4614/المطلب-الأول:-الفرقة-بالطَّلاق-بسبب-من-قبل-الزوجة-قبل-الدخول",
        answers: [
            {
                answer: "فلها ثلثُ المهْر",
                t: 0,
            },
            {
                answer: "فلها نِصفُ المهرِ",
                t: 0,
            },
            {
                answer: "فلا مهْرَ لها",
                t: 1,
            },
        ],
        category: "الفقه",
        topic: "الطلاق",
    },
    {
        id: 12,
        q: "وَقتُ أداءِ صَلاةِ الفَجرِ هو:",
        link: "https://dorar.net/hadith/sharh/23455",
        answers: [
            {
                answer: "قبلَ طُلوعِ الشَّمسِ قِيدَ رُمحٍ",
                t: 0,
            },
            {
                answer: "إذا صارَ ظِلُّ كُلِّ شِيءٍ مِثلَه",
                t: 0,
            },
            {
                answer: "ما لمْ يَطلُعْ قرنُ الشَّمسِ الأوَّلُ",
                t: 1,
            },
        ],
        category: "الحديث",
        topic: "الاختبار الرابع",
    },
    {
        id: 2,
        q: "يُشتَرط لاعتِكافِ الزَّوجةِ:",
        link: "https://www.dorar.net/feqhia/2829",
        answers: [
            {
                answer: "أن يأذَنَ لها زوجُها",
                t: 1,
            },
            {
                answer: "ألا تكون حامِلًا أو مُرضِع",
                t: 0,
            },
            {
                answer: "أن يكونَ معها مَحرَمٌ لها",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "الصيام",
    },
    {
        id: 8,
        q: "مانِعو الزَّكاةِ الذين ليْسوا في قبضةِ الإمامِ:",
        link: "http://host1.octal.com.sa/feqhia/2098",
        answers: [
            {
                answer: "يُقاتَلون حتى يُؤَدُّوها",
                t: 1,
            },
            {
                answer: "يَسكُت عنهم",
                t: 0,
            },
            {
                answer: "يُعامَلُوا بالحُسنَى حتَّى يُؤَدُّوها",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "الزكاة",
    },
    {
        id: 6,
        q: "طلاقُ الأعجميِّ وغيرِه إذا طلَّق بغيرِ العربيةِ:",
        link: "https://www.dorar.net/feqhia/4542/المبحث-الثالث:-الطلاق-بلسان-العجم",
        answers: [
            {
                answer: "يقعُ في الطلقةِ الثالثةِ فقطْ",
                t: 0,
            },
            {
                answer: "لا يقعُ مطلقًا",
                t: 0,
            },
            {
                answer: "يقعُ بالإجماع",
                t: 1,
            },
        ],
        category: "الفقه",
        topic: "الطلاق",
    },
    {
        id: 17,
        q: "التَّعيين في الرَّجعةِ للزَّوجة:",
        link: "https://www.dorar.net/feqhia/4651/الفرع-الأول:-ما-يشترط-في-الزوجة-المرتجعة#t-6",
        answers: [
            {
                answer: "يُستحبُّ",
                t: 0,
            },
            {
                answer: "لا يُشترَط",
                t: 0,
            },
            {
                answer: "يُشترَط",
                t: 1,
            },
        ],
        category: "الفقه",
        topic: "الطلاق",
    },
    {
        id: 8,
        q: "جُمَل (أنت طالقٌ، وطلقْتُ، وأنت مطلَّقة، وطلَّقْتك) :",
        link: "https://www.dorar.net/feqhia/4525/الفرع-الثاني:-ألفاظ-الطلاق-الصريح#t-1",
        answers: [
            {
                answer: "من صَريحِ الطَّلاقِ، ولا تَحتاج إلى النِّية",
                t: 1,
            },
            {
                answer: "لا يَنعقِدُ بها الطَّلاق",
                t: 0,
            },
            {
                answer: "مِن ألفاظ الكِناياتِ في الطَّلاق وتحتاجُ إلى النِّيَّة",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "الطلاق",
    },
    {
        id: 10,
        q: "مِن أقوال العلماءِ في حكمِ طلاقِ الثلاثِ في حقِّ غيرِ المدخولِ بها بلفظِ: أنتِ طالقٌ وطالقٌ وطالقٌ:",
        link: "https://www.dorar.net/feqhia/4568/الفرع-الثالث:-الطلاق-بألفاظ-متكررة-مع-العطف",
        answers: [
            {
                answer: "لا يقعُ",
                t: 0,
            },
            {
                answer: "لا يقعُ إلا طلقةً واحدةً",
                t: 1,
            },
            {
                answer: "يقعُ طلقتينِ",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "الطلاق",
    },
    {
        id: 14,
        q: "إذا أسلَمَ الزَّوجُ وتحتَه زوجةٌ كِتابيَّةٌ",
        link: "https://www.dorar.net/feqhia/4278",
        answers: [
            {
                answer: "فُسخَ النِّكاحُ",
                t: 0,
            },
            {
                answer: "بقيَ النِّكاحُ",
                t: 1,
            },
            {
                answer: "يَسقُط صَداقُها",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "النكاح",
    },
    {
        id: 16,
        q: "حُكْمُ زكاةِ المالِ العامِّ",
        link: "http://host1.octal.com.sa/feqhia/2117",
        answers: [
            {
                answer: "فَرْض",
                t: 0,
            },
            {
                answer: "مُستَحَبَّة",
                t: 0,
            },
            {
                answer: "لا تَجِب",
                t: 1,
            },
        ],
        category: "الفقه",
        topic: "الزكاة",
    },
    {
        id: 19,
        q: "مَن صلَّى رَكعةً مِن الفَجرِ ثمَّ طَلَعَتِ الشَّمسُ قبلَ أن يُتِمَّ صَلاتَه:",
        link: "https://dorar.net/hadith/sharh/26805",
        answers: [
            {
                answer: "فإنَّه تَسقُطُ عنه الفَريضةُ، ولا يَكونُ مُدرِكًا للوَقتِ",
                t: 0,
            },
            {
                answer: "فقد أدرَكَ الوقتَ وصحَّتْ صَلاتُه",
                t: 1,
            },
            {
                answer: "فقد فاتَهُ الوَقتُ",
                t: 0,
            },
        ],
        category: "الحديث",
        topic: "الاختبار السادس",
    },
    {
        id: 17,
        q: "قال رسولُ الله ﷺ: ولا يَتَمَنَّيَنَّ أحَدُكُمُ المَوْتَ: إمَّا مُحْسِنًا",
        link: "https://dorar.net/hadith/sharh/151191",
        answers: [
            {
                answer: "فَلَعَلَّهُ أنْ يَزْدادَ خَيْرًا",
                t: 1,
            },
            {
                answer: "فَلَهُ إِحسانُه",
                t: 0,
            },
            {
                answer: "أو مُسِيئًا",
                t: 0,
            },
        ],
        category: "الحديث",
        topic: "الاختبار السادس",
    },
    {
        id: 20,
        q: "مِن الذين لا تَشمَلُهم فِتنةُ القَبرِ:",
        link: "https://dorar.net/aqeeda/1716",
        answers: [
            {
                answer: "الشُّهداءُ",
                t: 1,
            },
            {
                answer: "العُلماءُ",
                t: 0,
            },
            {
                answer: "البارُّ بوَالِدَيهِ",
                t: 0,
            },
        ],
        category: "العقيدة",
        topic: "الإيمان باليوم الآخر",
    },
    {
        id: 18,
        q: "الحِكمةُ هي:",
        link: "https://dorar.net/hadith/sharh/150320",
        answers: [
            {
                answer: "القَولُ اللَّيِّنُ",
                t: 0,
            },
            {
                answer: "مَعرِفَةُ بَواطنِ الأُمورِ مِن ظَواهِرها",
                t: 0,
            },
            {
                answer: "العِلمِ المُشتَمِلِ على مَعرِفةِ اللهِ تعالَى",
                t: 1,
            },
        ],
        category: "الحديث",
        topic: "الاختبار الأول",
    },
    {
        id: 2,
        q: "في الحَديثَ: أَرْبَعٌ مَن كُنَّ فيه كانَ",
        link: "https://www.dorar.net/hadith/sharh/5965",
        answers: [
            {
                answer: "مُشرِكًا",
                t: 0,
            },
            {
                answer: "مُنَافِقًا خَالِصًا",
                t: 1,
            },
            {
                answer: "مُؤمِنًا مُقسِطًا",
                t: 0,
            },
        ],
        category: "الحديث",
        topic: "الاختبار الثالث",
    },
    {
        id: 6,
        q: "طلاقُ المجنونِ:",
        link: "https://www.dorar.net/feqhia/4500/الفرع-الأول:-طلاق-المجنون",
        answers: [
            {
                answer: "يصِحُّ رجعيًّا لا بائنًا",
                t: 0,
            },
            {
                answer: "يصِحُّ مطلقًا",
                t: 0,
            },
            {
                answer: "لا يصِحُّ",
                t: 1,
            },
        ],
        category: "الفقه",
        topic: "الطلاق",
    },
    {
        id: 19,
        q: "حُكمُ الرَّجعةِ إنْ طلَّق الرجُلُ زوجتَه طلقةً أو طلقتينِ، وكان قد دخَل بها، ولم يكنْ بعِوَضٍ:",
        link: "https://www.dorar.net/feqhia/4633/المطلب-الأول:-حكم-الرجعة",
        answers: [
            {
                answer: "مَكروهةٌ",
                t: 0,
            },
            {
                answer: "مباحةٌ",
                t: 1,
            },
            {
                answer: "واجبةٌ",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "الطلاق",
    },
    {
        id: 18,
        q: "بماذا  أوصَى رَسولُ الله صلَّى اللهُ عليه وسلَّم حُذيفةَ بن اليَمانِ عندما سَألَهُ عن الشَّرِّ؟",
        link: "https://dorar.net/aqeeda/3117",
        answers: [
            {
                answer: "أن يَلحَقَ بالشَّامِ فإنَّها خِيرَةُ الله مِن أَرضِه",
                t: 0,
            },
            {
                answer: "أن يَضرِبَ بِسَيفِه مَن يَشُقُّ جَماعَة المُسلِمينَ",
                t: 0,
            },
            {
                answer: "أن يَلزمَ جَماعَةَ المُسلمِينَ وإِمامَهُم",
                t: 1,
            },
        ],
        category: "العقيدة",
        topic: "لزوم الجماعة وذم البدع",
    },
    {
        id: 14,
        q: "إذا ادَّعى صاحِبُ المال أنَّه لم يَحُلْ عليه الحَوْلُ",
        link: "http://host1.octal.com.sa/feqhia/2113",
        answers: [
            {
                answer: "يُؤخَذ منه ماله كُلُّه",
                t: 0,
            },
            {
                answer: "مُصدَّق فيه",
                t: 1,
            },
            {
                answer: "لا يُصَدَّق فيه",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "الزكاة",
    },
    {
        id: 12,
        q: "إيضاحُ مَحَلِّ الذَّبحِ",
        link: "https://www.dorar.net/feqhia/3722/المطلب-الخامس:-إيضاح-محل-الذبح",
        answers: [
            {
                answer: "يُوضِّحُ المَحَلَّ ويَتبَيَّنُه ويَتفَقَّدُ المَوضِعَ",
                t: 1,
            },
            {
                answer: "يَتحَرَّى ويَذبَحُ بلا إيضاحٍ",
                t: 0,
            },
            {
                answer: "ليس بمَطلوبٍ",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "التذكية والعقيقة والصيد",
    },
    {
        id: 11,
        q: "طلاقُ السَّكران المعذورِ بسُكرِه:",
        link: "https://www.dorar.net/feqhia/4506/الفرع-الرابع:-طلاق-السكران#t-1",
        answers: [
            {
                answer: "يقعُ",
                t: 0,
            },
            {
                answer: "لا يقعُ",
                t: 1,
            },
            {
                answer: "مكروهٌ",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "الطلاق",
    },
    {
        id: 5,
        q: "كناياتُ الطَّلاق  هي:",
        link: "https://www.dorar.net/feqhia/4528/الفرع-الأول:-تعريف-كنايات-الطَّلاق",
        answers: [
            {
                answer: "ما يكون صريحًا في الطَّلاق",
                t: 0,
            },
            {
                answer: "ما يَحتمل لفظُه الطَّلاقَ وغيرَه",
                t: 1,
            },
            {
                answer: "ما لا يُراد به الطَّلاق",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "الطلاق",
    },
    {
        id: 5,
        q: "التعامُلُ بأسْهُمِ الشَّرِكات المختَلَطَة، وهي أسهُمُ الشَّرِكاتِ التي تَكون مُعامَلاتُها في الأصلِ مُباحةً، لكنَّها تتعامَلُ بالحَرامِ",
        link: "http://host1.octal.com.sa/feqhia/2206",
        answers: [
            {
                answer: "لا يَجوز",
                t: 1,
            },
            {
                answer: "يُكرَه",
                t: 0,
            },
            {
                answer: "يَجوز",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "الزكاة",
    },
    {
        id: 8,
        q: "قَالَ رَسُولُ اللَّهِ ﷺ: التَّسْبِيحُ لِلرِّجَالِ:",
        link: "https://dorar.net/hadith/sharh/13746",
        answers: [
            {
                answer: "والتَّكبيرُ للإمامِ",
                t: 0,
            },
            {
                answer: "والتَّهليلُ للصِّبيانِ",
                t: 0,
            },
            {
                answer: "وَالتَّصْفِيقُ للنِّساءِ",
                t: 1,
            },
        ],
        category: "الحديث",
        topic: "الاختبار السادس",
    },
    {
        id: 14,
        q: "طلاقُ الوَليِّ عن الصَّبي والمجنون:",
        link: "https://www.dorar.net/feqhia/4490/المطلب-الثاني:-حكم-الطلاق-بالولي",
        answers: [
            {
                answer: "لا يصِحُّ",
                t: 1,
            },
            {
                answer: "يجوزُ عن الصَّبي",
                t: 0,
            },
            {
                answer: "يجوزُ عن المجنون",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "الطلاق",
    },
    {
        id: 15,
        q: "مَعنَى (نَقُصُّ) في قَولِه تَعالَى: {نَحْنُ نَقُصُّ عَلَيْكَ أَحْسَنَ الْقَصَصِ}:",
        link: "https://www.dorar.net/tafseer/12/1",
        answers: [
            {
                answer: "نُدبِّرُ",
                t: 0,
            },
            {
                answer: "نَقطَعُ",
                t: 0,
            },
            {
                answer: "نُخبِرُ",
                t: 1,
            },
        ],
        category: "التفسير",
        topic: "يوسف",
    },
    {
        id: 3,
        q: "المقصودُ بقولِه تعالى: {الَّذِينَ أُوتُوا نَصِيبًا مِنَ الْكِتَابِ} هُم:",
        link: "https://dorar.net/tafseer/3/9#tt18",
        answers: [
            {
                answer: "المَجُوسُ",
                t: 0,
            },
            {
                answer: "المُشرِكونَ",
                t: 0,
            },
            {
                answer: "اليَهودُ",
                t: 1,
            },
        ],
        category: "التفسير",
        topic: "آل عمران",
    },
    {
        id: 17,
        q: "عن أنس رضي الله عنه: أنَّهُ رَأَى رَسولَ اللَّهِ ﷺ شَرِبَ لَبَنًا، وعَنْ يَسَارِهِ أبو بَكْرٍ، وعَنْ يَمِينِهِ أعْرَابِيٌّ، فأعْطَى الأعْرَابِيَّ فَضْلَهُ، ثُمَّ قالَ:",
        link: "https://www.dorar.net/hadith/sharh/151385",
        answers: [
            {
                answer: "الغَريبُ أوَّلًا",
                t: 0,
            },
            {
                answer: "الأيْمَنَ فَالأيْمَنَ",
                t: 1,
            },
            {
                answer: "كَبِّرِ كَبِّرِ ",
                t: 0,
            },
        ],
        category: "الحديث",
        topic: "الاختبار الأول",
    },
    {
        id: 16,
        q: "خُتمتْ سورةُ الأنبياءِ بالحديثِ عن سُنَّةٍ مِن سننِ اللهِ التي لا تتخلفُ؛ وهي:",
        link: "https://www.dorar.net/tafseer/21",
        answers: [
            {
                answer: "أن الحياةَ الدُّنيا تَخْدَعُ وتغرُّ أَهْلَهَا الذينَ يركنونَ إِلَيْهَا",
                t: 0,
            },
            {
                answer: "أنَّ العاقبةَ للمؤمنينَ",
                t: 1,
            },
            {
                answer: "أنَّ الشَّيطانَ للإنسانِ عَدُوٌّ مُبينٌ",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "الأنبياء",
    },
    {
        id: 1,
        q: "قَوله تعالى: {قُلْ أَتُنَبِّئُونَ اللَّهَ بِمَا لَا يَعْلَمُ فِي السَّمَوَاتِ وَلَا فِي الْأَرْضِ}، استِفهام على سَبيلِ:",
        link: "https://dorar.net/tafseer/10/8#tt9",
        answers: [
            {
                answer: "التَّقرير",
                t: 0,
            },
            {
                answer: "التَّعَجُّب",
                t: 0,
            },
            {
                answer: "التَّهَكم والتَّوبيخ",
                t: 1,
            },
        ],
        category: "التفسير",
        topic: "يونس",
    },
    {
        id: 19,
        q: 'في تكرارِ لفظةِ: "هيهاتَ" في قَولِه تَعالَى: {هَيْهَاتَ هَيْهَاتَ لِمَا تُوعَدُونَ} فَائِدَة: ',
        link: "https://www.dorar.net/tafseer/23/5",
        answers: [
            {
                answer: "بيانِ صدقِ هَذَا الوعيدِ المذكورِ على لسانِ الرَّسولِ",
                t: 0,
            },
            {
                answer: "تأكيدِ هذا البُعْدِ المذكور",
                t: 1,
            },
            {
                answer: "إِظهارُ العِنايَةِ بصِلَةِ المَوصُولِ",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "المؤمنون",
    },
    {
        id: 14,
        q: 'يقولُ النبيُّ ﷺ: "لَا حَسَدَ إلَّا في اثْنَتَيْنِ: رَجُلٌ آتَاهُ اللَّهُ مَالًا فَسُلِّطَ علَى هَلَكَتِهِ في الحَقِّ:',
        link: "https://www.dorar.net/hadith/sharh/2123",
        answers: [
            {
                answer: "ورَجُلٌ آتَاهُ اللَّهُ الحِكْمَةَ فَهو يَقْضِي بهَا ويُعَلِّمُهَا",
                t: 1,
            },
            {
                answer: "ورجلٌ خرجَ بنفسِهِ ومالِهِ فلمْ يرجعْ مِنْ ذلكَ بشيءٍ",
                t: 0,
            },
            {
                answer: "ورَجُلٌ ذَكَرَ اللَّهَ خَالِيًا فَفَاضَتْ عَيْنَاهُ",
                t: 0,
            },
        ],
        category: "الحديث",
        topic: "الاختبار الثالث",
    },
    {
        id: 7,
        q: "دَلَّ قَوله تَعالَى: {يَقْدُمُ قَوْمَهُ يَوْمَ الْقِيَامَةِ فَأَوْرَدَهُمُ النَّارَ} على :",
        link: "https://www.dorar.net/tafseer/11/19",
        answers: [
            {
                answer: "أنَّه ما مِن بَشرٍ مِن بني آدمَ إلَّا وسَيقدُمُ على النارِ",
                t: 0,
            },
            {
                answer: "أنَّ الإقدامَ لا يكونُ مَحمودًا دائمًا فقد يكونُ مَذمومًا",
                t: 0,
            },
            {
                answer: "أنَّ فِرعَون ماتَ كافِرًا",
                t: 1,
            },
        ],
        category: "التفسير",
        topic: "هود",
    },
    {
        id: 18,
        q: "إلقاءُ الحَيَوانِ بعد ذَبحِه في الماءِ الحارِّ لِنَزعِ الرِّيشِ:",
        link: "https://www.dorar.net/feqhia/3710/مطلب:-نتف-الريش-بالماء-الحار",
        answers: [
            {
                answer: "لا يَجوزُ؛ لِتَعذيبِ الحَيَوانِ",
                t: 0,
            },
            {
                answer: "يَجوزُ",
                t: 1,
            },
            {
                answer: "يُكرَهُ لِلمُثلَةٍ",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "التذكية والعقيقة والصيد",
    },
    {
        id: 5,
        q: "أعلَنَت وسائلُ إعْلامٍ أمريكيةٌ متعَدِّدةٌ خُطَطَ كَنيسةٍ أمريكيةٍ للإعْلانِ عن يومٍ عالميٍّ يُسمَّى:",
        link: "https://www.dorar.net/history/?page=293",
        answers: [
            {
                answer: "اليومَ العالميَّ للكنائسِ البروتستانتيَّةِ",
                t: 0,
            },
            {
                answer: "اليومَ العالميَّ لحَرقِ القرآنِ",
                t: 1,
            },
            {
                answer: "اليومَ العالميَّ لقراءةِ الإنجيلِ",
                t: 0,
            },
        ],
        category: "التاريخ",
        topic: "التاريخ المعاصر",
    },
    {
        id: 5,
        q: "لُبْس الحُلِيِّ في الإحداد",
        link: "https://www.dorar.net/feqhia/5067",
        answers: [
            {
                answer: "يَجوزُ أمامَ أهلِها ومَحارِمها",
                t: 0,
            },
            {
                answer: "لا يَجوزُ",
                t: 1,
            },
            {
                answer: "يَجوزُ",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "اللعان والعدة",
    },
    {
        id: 10,
        q: "قَول اللَّه تَعالَى: {سَأُلْقِي فِي قُلُوبِ الَّذِينَ كَفَرُوا الرُّعْبَ}، التَّعبير بِإلقاء الرُّعب في القَلبِ وليس بـ(رَعَبْته أو أرعَبتُه):",
        link: "https://dorar.net/tafseer/8/4",
        answers: [
            {
                answer: "لتَخصِيصهِم بالرُّعبِ دونَ المؤمنينَ",
                t: 0,
            },
            {
                answer: "لتَأكيدِ وُصولِ الرُّعبِ إلى قُلوبِهم",
                t: 0,
            },
            {
                answer: "لِما في التَّعبيرِ بِإلقاءِ الرُّعبِ مِنَ الإشعارِ بِأنَّه يُصَبُّ في القُلوبِ دُفعةً واحِدةً",
                t: 1,
            },
        ],
        category: "التفسير",
        topic: "الأنفال",
    },
    {
        id: 4,
        q: "بَدَأتِ الدَّعوةُ إلى العاميَّةِ مع:",
        link: "https://dorar.net/arabia/2298",
        answers: [
            {
                answer: "سُقوطِ الخِلافَةِ العُثمانِيَّةِ بعدَ الحَربِ العالميَّة الثانِيَةِ",
                t: 0,
            },
            {
                answer: "بِدايةِ الحَمَلاتِ الصَّليبيَّةِ على بلادِ المُسلِمينَ",
                t: 1,
            },
            {
                answer: "التَّرَفِ الذي أَصابَ أواخِرَ العَصرِ العَبَّاسِيِّ",
                t: 0,
            },
        ],
        category: "اللغة العربية",
        topic: "فقة اللغة",
    },
    {
        id: 13,
        q: "دَلَّ قَوله تَعالَى: {وَقَالَ الْمَلِكُ إِنِّي أَرَى سَبْعَ بَقَرَاتٍ سِمَانٍ يَأْكُلُهُنَّ سَبْعٌ عِجَافٌ} على:",
        link: "https://www.dorar.net/tafseer/12/10",
        answers: [
            {
                answer: "أنَّ الرُّؤيا الصَّادِقة للمُؤمِنينَ فقط",
                t: 0,
            },
            {
                answer: "فَسادِ رُؤيا الكافِرِ",
                t: 0,
            },
            {
                answer: "صِحَّة رُؤيا الكافِرِ",
                t: 1,
            },
        ],
        category: "التفسير",
        topic: "يوسف",
    },
    {
        id: 17,
        q: "إذا خَلَط لَبَنَ المَرأةِ بمائعٍ وغَلَب على المائعِ",
        link: "https://www.dorar.net/feqhia/5118",
        answers: [
            {
                answer: "ثَبَت التَّحريمُ",
                t: 1,
            },
            {
                answer: "يَثبُتُ به التَّحريمُ إذا كان عُمُرُ الرَّضيعِ أقلَّ من سَنةٍ",
                t: 0,
            },
            {
                answer: "انتَفَى التَّحريمُ",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "الرضاع والحضانة والنفقات",
    },
    {
        id: 10,
        q: "المرادُ بِالوَلَدِ في قَولِه تَعالَى: {وَقَالُوا اتَّخَذَ اللهُ وَلَدًا}: ",
        link: "https://www.dorar.net/tafseer/21/5",
        answers: [
            {
                answer: "عِيسَى ابنُ مَريمَ",
                t: 0,
            },
            {
                answer: "عُزَيْرٌ",
                t: 0,
            },
            {
                answer: "المَلَائِكَة",
                t: 1,
            },
        ],
        category: "التفسير",
        topic: "الأنبياء",
    },
    {
        id: 11,
        q: "مما يترتَّبُ على نُكولِ الزَّوجةِ عنِ اللِّعانِ:",
        link: "https://www.dorar.net/feqhia/4933",
        answers: [
            {
                answer: "نَسَب الوَلَد لِلزَّوج",
                t: 0,
            },
            {
                answer: "تَصديقها فيما تقول",
                t: 0,
            },
            {
                answer: "إقامةُ حَدِّ الزِّنا عليها",
                t: 1,
            },
        ],
        category: "الفقه",
        topic: "اللعان والعدة",
    },
    {
        id: 15,
        q: "تُوفِّيَت فاطمةُ رضيَ اللهُ عنها:",
        link: "https://cutt.us/awY72",
        answers: [
            {
                answer: "بعدَ مَوتِ النبيِّ صلَّى اللهُ عليه وسلَّم بسَنَتينِ",
                t: 0,
            },
            {
                answer: "بعدَ مَوتِ النبيِّ صلَّى اللهُ عليه وسلَّم بخَمسةِ أَشهُرٍ",
                t: 1,
            },
            {
                answer: "قبلَ مَوتِ النبيِّ صلَّى اللهُ عليه وسلَّم بشَهرٍ",
                t: 0,
            },
        ],
        category: "التاريخ",
        topic: "الخلفاء الراشدون",
    },
    {
        id: 5,
        q: "أَسماءُ الأماكِن مِثل (مَفْرق، ومَطْلع) تُقاسُ على وَزنِ:",
        link: "https://dorar.net/arabia/1128",
        answers: [
            {
                answer: "مَفْعَل",
                t: 1,
            },
            {
                answer: "فَعْلَل",
                t: 0,
            },
            {
                answer: "أَفْعَل",
                t: 0,
            },
        ],
        category: "اللغة العربية",
        topic: "الصرف",
    },
    {
        id: 20,
        q: "مَعنَى قَولِه تَعالَى: {جُذَاذًا}",
        link: "https://www.dorar.net/tafseer/21/10",
        answers: [
            {
                answer: "أَجزاء",
                t: 0,
            },
            {
                answer: "قِطَعًا",
                t: 0,
            },
            {
                answer: "فُتاتًا وحُطامًا",
                t: 1,
            },
        ],
        category: "التفسير",
        topic: "الأنبياء",
    },
    {
        id: 12,
        q: "مِن أهمِّ الموضوعاتِ التي اشْتَمَلَتْ عليها سُورةُ الأَنبياءِ:",
        link: "https://www.dorar.net/tafseer/21",
        answers: [
            {
                answer: "التَّذكير بما أصابَ الأممَ السَّالفَةَ من جرَّاءِ تكذيبِهم رَسُلَهُمْ",
                t: 1,
            },
            {
                answer: "التَّذكير بما أصابَ المُسلِمين يومَ أُحُدٍ",
                t: 0,
            },
            {
                answer: "التَّذكير بما أصابَ كُفَّارَ قريشٍ",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "الأنبياء",
    },
    {
        id: 4,
        q: "غيرُ المدخولِ بها:",
        link: "https://www.dorar.net/feqhia/4651/الفرع-الأول:-ما-يشترط-في-الزوجة-المرتجعة#t-3",
        answers: [
            {
                answer: "تصِحُّ الرجعةُ قبْل استبرائها بحيضة",
                t: 0,
            },
            {
                answer: "تصِحُّ الرجعةُ مطلقًا",
                t: 0,
            },
            {
                answer: "لا رجْعةَ لها",
                t: 1,
            },
        ],
        category: "الفقه",
        topic: "الطلاق",
    },
    {
        id: 9,
        q: "ما مِن نَبيٍّ يَبعَثُه اللهُ تَعالَى إلَّا:",
        link: "https://dorar.net/hadith/sharh/151324",
        answers: [
            {
                answer: "أعْطاه مُعجِزةً يُستَدَلُّ بها على نُبوَّتِه",
                t: 1,
            },
            {
                answer: "بَشَّرَ أُمَّتَه بِنَبِيِّ آخرِ الزَّمانِ محمدٍ ﷺ",
                t: 0,
            },
            {
                answer: "أيَّدَه اللهُ بمَلَكٍ يُكلِّمُ النَّاسَ عنه",
                t: 0,
            },
        ],
        category: "الحديث",
        topic: "الاختبار السابع",
    },
    {
        id: 17,
        q: "معنى {فَيَرْكُمَهُ} في قوله: {وَيَجْعَلَ الْخَبِيثَ بَعْضَهُ عَلَى بَعْضٍ فَيَرْكُمَهُ جَمِيعًا}:",
        link: "https://dorar.net/tafseer/8/11",
        answers: [
            {
                answer: "يَجمَعَه",
                t: 1,
            },
            {
                answer: "يُفنيَه",
                t: 0,
            },
            {
                answer: "يُهلِكَه",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "الأنفال",
    },
    {
        id: 6,
        q: "قال تَعالَى: {وَقَدْ آَتَيْنَاكَ مِنْ لَدُنَّا ذِكْرًا} سُمِّيَ القُرآنُ بالذِّكرِ لأنَّه:",
        link: "https://dorar.net/tafseer/20/14",
        answers: [
            {
                answer: "كِتابٌ ذَاكِرٌ؛ بمعنَى مَذكُور أي: مَتلُو",
                t: 0,
            },
            {
                answer: "يَذكُرُ حَالَ المُؤمِنينَ وحَالَ الكافِرينَ في الدُّنيا ومَآلَهُم جَميعًا في الآخِرَةِ",
                t: 0,
            },
            {
                answer: "يُذَكِّرُ أنواعَ آلاءِ اللهِ تَعالَى ونَعمائِه؛ ففيه التَّذكيرُ والمواعِظُ",
                t: 1,
            },
        ],
        category: "التفسير",
        topic: "طه",
    },
    {
        id: 3,
        q: "إذا شَرِبَ شَخصٌ اللَّبَنَ، أو أكَلَ طَعامًا فيه دَسَمٌ، فإنَّه:",
        link: "https://dorar.net/hadith/sharh/151320",
        answers: [
            {
                answer: "يُستحَبُّ أن يُنظِّفَ فَمَه منه قبلَ أن يُصلِّيَ",
                t: 1,
            },
            {
                answer: "لا يَجوزُ له أن يَتمَضمَضَ لأنَّ في ذلك إِهدارًا للنِّعمَة",
                t: 0,
            },
            {
                answer: "تَحرُمُ عَليهِ الصَّلاةُ حتَّى يَتوَضَّأَ",
                t: 0,
            },
        ],
        category: "الحديث",
        topic: "الاختبار الخامس",
    },
    {
        id: 19,
        q: "المراد بالزَّبورِ في قَولِه تَعالَى: {وَلَقَدْ كَتَبْنَا في الزَّبُورِ}:",
        link: "https://www.dorar.net/tafseer/21/21",
        answers: [
            {
                answer: "الكُتُب المنزَّلة من السَّماء",
                t: 1,
            },
            {
                answer: "اللَّوح المَحْفُوظ",
                t: 0,
            },
            {
                answer: "صُحُفِ مُوسَى",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "الأنبياء",
    },
    {
        id: 17,
        q: "كان الوَحيُ ثَقيلًا على النَّبيِّ ﷺ:",
        link: "https://www.dorar.net/hadith/sharh/23142",
        answers: [
            {
                answer: "لضَعْفِ القُوَّةِ البشريَّةِ عن تحمُّلِ ذلك الوارِدِ العظيمِ مِن الجَنابِ الجَلِيلِ",
                t: 1,
            },
            {
                answer: "لضَخامةِ المَلَكِ الذي يَنزِلُ بالوَحيِ",
                t: 0,
            },
            {
                answer: "لكَثرةِ ما يُوحِي إليه",
                t: 0,
            },
        ],
        category: "الحديث",
        topic: "الاختبار الثاني",
    },
    {
        id: 4,
        q: "بدأ تَطبيقُ الشريعةِ الإسلاميةِ في السودانِ يُنفَّذُ مِن شهرِ ذي الحِجةِ 1403هـ / أيلول 1983م:",
        link: "https://www.dorar.net/history/?page=276",
        answers: [
            {
                answer: "فاستَحسَنت جامعةُ الدولِ العربيةِ القرارَ وأيَّدَته",
                t: 0,
            },
            {
                answer: "فأثارَ هذا الأمرُ الأعداءَ شرقًا وغَربًا",
                t: 1,
            },
            {
                answer: "فقاطَعت كثيرٌ من الدولِ العربيةِ السودانَ",
                t: 0,
            },
        ],
        category: "التاريخ",
        topic: "التاريخ المعاصر",
    },
    {
        id: 6,
        q: "أعلَنَتِ الولاياتُ المتحدةُ الأمريكيةُ عن قَتلِ:",
        link: "https://www.dorar.net/history/?page=293",
        answers: [
            {
                answer: "أبي مُصعَبٍ الزَّرقاويِّ",
                t: 0,
            },
            {
                answer: "أسامةَ بنِ لادنٍ زعيمِ تنظيمِ القاعدةِ",
                t: 1,
            },
            {
                answer: "أبي بكرٍ البَغداديِّ ",
                t: 0,
            },
        ],
        category: "التاريخ",
        topic: "التاريخ المعاصر",
    },
    {
        id: 18,
        q: "قرَّرَ المحتلُّ الصِّهْيَوْنيُّ هدْمَ المسجدِ العُمَريَّ الواقعَ في قريةِ أُمِّ طوبا جنوبَ مدينةِ القُدسِ بدَعْوى:",
        link: "https://www.dorar.net/history/?page=289",
        answers: [
            {
                answer: "استخدامِ المقاومة الفلسطينية له في بعضِ الأعمالِ الإرهابيةِ",
                t: 0,
            },
            {
                answer: "أنَّ أصلَ مكانِه كَنيسة العَذراء",
                t: 0,
            },
            {
                answer: "البناءِ غيرِ المرخَّصِ دونَ سابقِ إنذارٍ",
                t: 1,
            },
        ],
        category: "التاريخ",
        topic: "التاريخ المعاصر",
    },
    {
        id: 17,
        q: "الكَلِمةُ الفارقةُ بين الكُفرِ والإسلامِ",
        link: "https://dorar.net/aqeeda/212",
        answers: [
            {
                answer: "لا خالِقَ إلَّا اللهُ",
                t: 0,
            },
            {
                answer: "لا ربَّ إلَّا اللهُ",
                t: 0,
            },
            {
                answer: "لا إلهَ إلَّا اللهُ",
                t: 1,
            },
        ],
        category: "العقيدة",
        topic: "توحيد الربوبية",
    },
    {
        id: 12,
        q: '"سَحَّاءُ اللَّيلَ والنَّهارَ" تَعنِي:',
        link: "https://dorar.net/hadith/sharh/151154",
        answers: [
            {
                answer: "تَكثُرُ فيها العَظَمةُ",
                t: 0,
            },
            {
                answer: "كثيرةُ العَطاءِ في كُلِّ الأوقاتِ",
                t: 1,
            },
            {
                answer: "تُغَطِّي اللَّيلَ والنَّهارَ",
                t: 0,
            },
        ],
        category: "الحديث",
        topic: "الاختبار الأول",
    },
    {
        id: 11,
        q: "قَولُه تَعالَى: {لَا تَخَافُ دَرَكًا وَلَا تَخْشَى} مَعنَى {دَرَكًا}",
        link: "https://dorar.net/tafseer/20/9",
        answers: [
            {
                answer: "غَرَقًا",
                t: 0,
            },
            {
                answer: "تَبِعةٌ أو لَحاقٌ",
                t: 1,
            },
            {
                answer: "جاهًا ولا سُلطانًا",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "طه",
    },
    {
        id: 4,
        q: "قُدِّمتِ العِبادةُ على الاسْتِعانةِ في قولِه: {إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ}",
        link: "https://dorar.net/tafseer/1/1#tt7",
        answers: [
            {
                answer: "لأنَّ العِبادةَ من أسْبابِ حُصولِ الإعانةِ وإجابةِ الحاجةِ",
                t: 1,
            },
            {
                answer: "لأنَّ الاسْتِعانةَ سَببٌ للعِبادةِ",
                t: 0,
            },
            {
                answer: "مُراعاةً لفَواصِلِ الآياتِ",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "الفاتحة",
    },
    {
        id: 4,
        q: 'قيلَ لزَيدِ بنِ أرْقَمَ: "كم غَزا النبيُّ صلَّى اللهُ عليه وسلَّم من غزوةٍ؟ فقال:',
        link: "https://cutt.us/MJJM1",
        answers: [
            {
                answer: "أربعَ عَشْرةَ",
                t: 0,
            },
            {
                answer: "اثْنتا عَشْرةَ",
                t: 0,
            },
            {
                answer: "تِسعَ عَشْرةَ",
                t: 1,
            },
        ],
        category: "التاريخ",
        topic: "العهد النبوي",
    },
    {
        id: 11,
        q: "مَعنَى قَولِه تعالى: {وَأَسَرُّوا النَّجْوَى}:",
        link: "https://dorar.net/tafseer/20/7",
        answers: [
            {
                answer: "أَصَرُّوا على كُفرِهِم وعِنادِهِم",
                t: 0,
            },
            {
                answer: "تَجاذَبوا الحديثَ سِرًّا فيما بينَهم، وبالَغوا في إخفائِه مِن فِرعَونَ",
                t: 1,
            },
            {
                answer: "أَشارَ بَعضُهم إلى بَعضٍ سِرًّ: أنِ انْجوا بأَنفُسِكُم",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "طه",
    },
    {
        id: 20,
        q: "يقول رسول الله ﷺ: مَنِ اتَّبَعَ جَنَازَةَ مُسْلِمٍ، إيمَانًا واحْتِسَابًا، وكانَ معهُ حتَّى يُصَلَّى عَلَيْهَا ويَفْرُغَ مِن دَفْنِهَا، فإنَّه يَرْجِعُ مِنَ الأجْرِ:",
        link: "https://dorar.net/hadith/sharh/2684",
        answers: [
            {
                answer: "بقِيرَاطَيْنِ",
                t: 1,
            },
            {
                answer: "وقد غُفِرَ له ما تَقدَّم مِن ذَنبِه",
                t: 0,
            },
            {
                answer: "بخيرٍ ممَّا طَلعَت عليه الشَّمسُ",
                t: 0,
            },
        ],
        category: "الحديث",
        topic: "الاختبار الثالث",
    },
    {
        id: 11,
        q: "(العالَمُ كان في الأزَلِ أجزاءً مَبثوثةً تَتحرَّكُ على غَيرِ استِقامةٍ واصطَكَّتِ اتِّفاقًا فحَصَل العالَمُ بالشَّكلِ الَّذي تَراهُ). هذا قَولُ",
        link: "https://dorar.net/aqeeda/234",
        answers: [
            {
                answer: "شِرْذِمةٌ قَليلةٌ منَ الدَّهريَّةِ",
                t: 1,
            },
            {
                answer: "أهلِ الكِتابِ",
                t: 0,
            },
            {
                answer: "المُشرِكين",
                t: 0,
            },
        ],
        category: "العقيدة",
        topic: "توحيد الربوبية",
    },
    {
        id: 13,
        q: "قولُه تَعالَى: {فَغَشِيَهُمْ مِنَ الْيَمِّ مَا غَشِيَهُمْ} فيه إبهامٌ؛ والتَّعبيرُ بالاسمِ المُبهَم الذي هو المَوصولُ يدُلُّ على",
        link: "https://dorar.net/tafseer/20/9",
        answers: [
            {
                answer: "تَحقيرِ الأمرِ، ودَحْضِ شأنِه",
                t: 0,
            },
            {
                answer: "تَعظيمِ الأمرِ، وتَفخيمِ شأنِه",
                t: 1,
            },
            {
                answer: "التَّأكيدُ على فِعلِ الغَشَيانِ",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "طه",
    },
    {
        id: 16,
        q: "قَولُه تعالى: {وَلَقَدْ بَوَّأْنَا بَنِي إِسْرَائِيلَ مُبَوَّأَ صِدْقٍ} أي:",
        link: "https://dorar.net/tafseer/10/31",
        answers: [
            {
                answer: "رِزقًا كثيرًا مُباركًا",
                t: 0,
            },
            {
                answer: "كِتابًا صادِقًا؛ والمَقصُود: التَّوراة",
                t: 0,
            },
            {
                answer: "مُنزَلًا مَحمودًا مُختارًا",
                t: 1,
            },
        ],
        category: "التفسير",
        topic: "يونس",
    },
    {
        id: 14,
        q: "(تضمَّن اللهُ لِمَن قرأَ القُرآنَ، واتَّبعَ ما فيه ألَّا يَضِلَّ في الدُّنيا، ولا يَشقَى في الآخرةِ)، ثم تَلا هذه الآيةَ: {فَمَنِ اتَّبَعَ هُدَايَ فَلَا يَضِلُّ وَلَا يَشْقَى}). قائلُ هذه العِبارةِ هو:",
        link: "https://dorar.net/tafseer/20/17",
        answers: [
            {
                answer: "ابنُ عبَّاسٍ",
                t: 1,
            },
            {
                answer: "أبو سَعيدٍ الخُدرِيُّ",
                t: 0,
            },
            {
                answer: "ابنُ مَسعودٍ",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "طه",
    },
    {
        id: 4,
        q: "في قَولِه تَعالَى: {اذْهَبَا إِلَى فِرْعَوْنَ إِنَّهُ طَغَى * فَقُولَا لَهُ قَوْلًا لَيِّنًا لَعَلَّهُ يَتَذَكَّرُ أَوْ يَخْشَى}:",
        link: "https://dorar.net/tafseer/20/6",
        answers: [
            {
                answer: "تَحذِيرٌ مِن الغَفلَةِ التي تُودِي بصَاحِبِها إلى مُعارَضَةِ سُنَنِ الله في خَلقِه",
                t: 0,
            },
            {
                answer: "تَنبيهٌ على نِهايةِ تَعظيمِ حَقِّ الأبَوينِ لأنَّه عليه السلامُ كان قد ربَّاه فِرعَونُ، فأمَره أن يُخاطِبَه بالرِّفقِ؛ رِعايةً لتِلك الحُقوقِ",
                t: 1,
            },
            {
                answer: "إِشارةٌ إلى الصَّبرِ الجَميلِ على الأَذَى في سَبيلِ دِينِ الله عزَّ وجلَّ",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "طه",
    },
    {
        id: 19,
        q: 'في الحديثِ: "مَن قَامَ رَمَضَانَ إيمَانًا واحْتِسَابًا غُفِرَ له ما تَقَدَّمَ مِن ذَنْبِهِ" المَقصُود بقِيامِ رمضان:',
        link: "https://dorar.net/hadith/sharh/1455",
        answers: [
            {
                answer: "أن يَقومَ العَبدُ بما فَرضَ اللهُ عليه ويَنتهِي عمَّا نَهاهُ اللهُ عنه",
                t: 0,
            },
            {
                answer: "القِيامُ بأَركانِ الصِّيامِ تامَّة على وَجهِها الصَّحيحِ",
                t: 0,
            },
            {
                answer: "صَلاةُ التَّراويحِ",
                t: 1,
            },
        ],
        category: "الحديث",
        topic: "الاختبار الثالث",
    },
    {
        id: 19,
        q: "أَعلنَتْ أمريكا قطْعَ المساعَداتِ التي كانت تُقدِّمُها للسودانِ عَقِبَ ثورةِ حَزِيرَانَ بقيادةِ عُمرَ البشيرِ:",
        link: "https://www.dorar.net/history/?page=279",
        answers: [
            {
                answer: "بسببِ استِبدادِ عمرَ البَشيرِ  بالسُّلطةِ ",
                t: 0,
            },
            {
                answer: "لأنَّ مَيلَ هذا الاتجاهِ الجديدِ إسلاميٌّ",
                t: 1,
            },
            {
                answer: "بسببِ تَفْجيرِ السفارةِ الأمريكيةِ في السودانِ",
                t: 0,
            },
        ],
        category: "التاريخ",
        topic: "التاريخ المعاصر",
    },
    {
        id: 1,
        q: "أوَّلُ شيءٍ فعلَهُ أبو بكرٍ رضيَ اللهُ عنه بعدَ تَولِّيه الخِلافةَ",
        link: "https://cutt.us/JFecc",
        answers: [
            {
                answer: "إِنفاذُ جَيشِ أُسامةَ",
                t: 1,
            },
            {
                answer: "تَوزِيعُ الجُيوشِ خارجَ المدينةِ",
                t: 0,
            },
            {
                answer: "حاربَ المُرتَدِّينَ",
                t: 0,
            },
        ],
        category: "التاريخ",
        topic: "الخلفاء الراشدون",
    },
    {
        id: 4,
        q: "وصَفوا يوسفَ بالصِّدِّيق في قوله تعالى: {يُوسُفُ أَيُّهَا الصِّدِّيقُ}:",
        link: "https://www.dorar.net/tafseer/12/10",
        answers: [
            {
                answer: "مِن بابِ بَراعة الِاستِهلال",
                t: 1,
            },
            {
                answer: "سُخريةً مِنه",
                t: 0,
            },
            {
                answer: "تَودُّدًا إليه",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "يوسف",
    },
    {
        id: 3,
        q: "الذي غَسَّل فاطمةَ رضيَ اللهُ عنها:",
        link: "https://cutt.us/awY72",
        answers: [
            {
                answer: "عليٌّ رضيَ اللهُ عنه والحسنُ والحُسينُ",
                t: 0,
            },
            {
                answer: "عائشةُ وحَفصةُ رضيَ اللهُ عنهما",
                t: 0,
            },
            {
                answer: "عليٌّ رضيَ اللهُ عنه وأسماءُ بنتُ عُمَيسٍ",
                t: 1,
            },
        ],
        category: "التاريخ",
        topic: "الخلفاء الراشدون",
    },
    {
        id: 5,
        q: "المَقصودُ بذِمَّةِ اللهِ، الَّتي وَرَد ذِكرُها في حَديثِ: «مَن صَلَّى الصُّبحَ فهُوَ في ذِمَّةِ اللهِ»:",
        link: "https://dorar.net/hadith/sharh/23391",
        answers: [
            {
                answer: "أي: في عَفوِه ومَغفِرَتِه",
                t: 0,
            },
            {
                answer: "أي: في أمانِه وضَمانتِه",
                t: 1,
            },
            {
                answer: "أي: في نَعيمِ جَنَّتِه",
                t: 0,
            },
        ],
        category: "الحديث",
        topic: "الاختبار السابع",
    },
    {
        id: 14,
        q: "في قولِه تعالى: {وَمِنْهُمْ مَنْ يَقُولُ ائْذَنْ لِي وَلَا تَفْتِنِّي}، معنى (لَا تَفْتِنِّي):",
        link: "https://dorar.net/tafseer/9/19",
        answers: [
            {
                answer: "لا تَبتَلني بالخُروجِ للجِهادِ في الحَرِّ فإنِّي شَديدُ العَطَش",
                t: 0,
            },
            {
                answer: "لا تَبتَلني بالحَربِ والسَّيفِ؛ فإنِّي جَبانٌ لا أقدِرُ على الحَربِ",
                t: 0,
            },
            {
                answer: "لا تَبتَلِني برُؤيةِ نِساءِ الرُّومِ؛ فإنِّي إنْ رأيتُهنَّ لا أصبِرُ عَنهنَّ",
                t: 1,
            },
        ],
        category: "التفسير",
        topic: "التوبة",
    },
    {
        id: 16,
        q: "قَولُه تَعالَى: {يَتَخَافَتُونَ بَيْنَهُمْ إِنْ لَبِثْتُمْ إِلَّا عَشْرًا} إذا ذُكِرَ العددُ دونَ مَعدودِه المُذَكَّرِ",
        link: "https://dorar.net/tafseer/20/14",
        answers: [
            {
                answer: "حُذِفَت منه التَّاءُ",
                t: 0,
            },
            {
                answer: "جاز فيه الوَجهانِ؛ حَذفُ التَّاءِ، وذِكرُها",
                t: 1,
            },
            {
                answer: "أُثبِتَت فيه التَّاءُ",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "طه",
    },
    {
        id: 9,
        q: "تَنظيمٌ في الجيشِ المصريِّ قام بانقِلابٍ مُسلَّحٍ لم تُرَقْ به دماءٌ:",
        link: "https://www.dorar.net/history/?page=261",
        answers: [
            {
                answer: "تنظيمُ العملِ الحُرِّ",
                t: 0,
            },
            {
                answer: "تنظيمُ الضبَّاطِ الأحْرارِ",
                t: 1,
            },
            {
                answer: "تنظيمُ الجيشِ الحُرِّ",
                t: 0,
            },
        ],
        category: "التاريخ",
        topic: "التاريخ المعاصر",
    },
    {
        id: 8,
        q: "وِلايةُ المُسلِمِ في عقدِ كافِرةٍ",
        link: "https://www.dorar.net/feqhia/4113",
        answers: [
            {
                answer: "يجوزُ إن كانتِ ابنتَه",
                t: 0,
            },
            {
                answer: "لا يجوزُ",
                t: 1,
            },
            {
                answer: "يجوزُ مُطلقًا",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "النكاح",
    },
    {
        id: 20,
        q: "مَعنَى قَولِه تَعالَى: {يَكْلَؤُكُمْ}:",
        link: "https://www.dorar.net/tafseer/21/8",
        answers: [
            {
                answer: "يَحْفَظُكُم",
                t: 1,
            },
            {
                answer: "يَسْمَعُكُم",
                t: 0,
            },
            {
                answer: "يَمْنَعُكُم",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "الأنبياء",
    },
    {
        id: 18,
        q: "قَولُه تَعالَى: {وَكَذَلِكَ الْيَوْمَ تُنْسَى} مَعنَى {تُنسَى}",
        link: "https://dorar.net/tafseer/20/18",
        answers: [
            {
                answer: "تُترَكُ في العَذابِ",
                t: 1,
            },
            {
                answer: "لا تُعرَف",
                t: 0,
            },
            {
                answer: "تُمنَع مِن الكلامِ",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "طه",
    },
    {
        id: 8,
        q: "مِن مَعاني السِّين وسَوف التي تَدخُلُ على الفِعلِ المُضارِع:",
        link: "https://dorar.net/arabia/22",
        answers: [
            {
                answer: "الاستِدلالُ",
                t: 0,
            },
            {
                answer: "الاستِقبالُ",
                t: 1,
            },
            {
                answer: "الإِكثارُ",
                t: 0,
            },
        ],
        category: "اللغة العربية",
        topic: "النحو",
    },
    {
        id: 15,
        q: "معنى (بغيًّا) في قوله تعالى: {أَنَّى يَكُونُ لِي غُلَامٌ وَلَمْ يَمْسَسْنِي بَشَرٌ وَلَمْ أَكُ بَغِيًّا}:",
        link: "https://www.dorar.net/tafseer/19/4#tt7",
        answers: [
            {
                answer: "زانِية",
                t: 1,
            },
            {
                answer: "كاذِبَة",
                t: 0,
            },
            {
                answer: "متزوِّجة",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "مريم",
    },
    {
        id: 4,
        q: " انتهَزَ فرصةَ إهمالِ الرُّماةِ وصيةَ نبيِّهم لهم حين نزَلوا يحصُدونَ الغنائمَ فالْتَفَّ خلفَهم وأعمَلَ الحربَ فيهم:",
        link: "https://cutt.us/K1JQl",
        answers: [
            {
                answer: "عِكرمةُ بن أبي جهلٍ",
                t: 0,
            },
            {
                answer: "أبو سُفيانَ بنُ حربٍ",
                t: 0,
            },
            {
                answer: " خالدُ بنُ الوليدِ",
                t: 1,
            },
        ],
        category: "التاريخ",
        topic: "العهد النبوي",
    },
    {
        id: 2,
        q: "في قَولِه تَعالَى: {فَلَمَّا أَتَاهَا نُودِيَ يَا مُوسَى * إِنِّي أَنَا رَبُّكَ فَاخْلَعْ نَعْلَيْكَ إِنَّكَ بِالْوَادِ الْمُقَدَّسِ طُوًى} حُجةٌ على مَن يقولُ:",
        link: "https://dorar.net/tafseer/20/2",
        answers: [
            {
                answer: "بخَلْقِ القُرآنِ، ويَزعُمُ أنَّ اللهَ لا يَجوزُ عَليهِ الكَلامُ",
                t: 1,
            },
            {
                answer: "بإمامةِ عَليٍّ وأنَّه أَوْلى بالخِلافةِ من أبي بَكرٍ",
                t: 0,
            },
            {
                answer: "بأنْ لا قَدرَ وأنَّ الأمْرَ أُنُفٌ",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "طه",
    },
    {
        id: 8,
        q: "في قولِه: {إِنَّمَا يَسْتَأْذِنُكَ الَّذِينَ لَا يُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ}، فيه رَدٌّ على الكرَّاميَّةِ في قولِهم:",
        link: "https://dorar.net/tafseer/9/18#tt7",
        answers: [
            {
                answer: "الإيمانُ إقرارٌ وقولٌ",
                t: 0,
            },
            {
                answer: "الإيمانُ هو مجرَّدُ الإقرارِ",
                t: 1,
            },
            {
                answer: "الإيمانُ قولٌ وعملٌ",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "التوبة",
    },
    {
        id: 5,
        q: "معنى (تُسيمونَ) في قولِه تعالى: {وَمِنْهُ شَجَرٌ فِيهِ تُسِيمُونَ}:",
        link: "https://dorar.net/tafseer/16/3",
        answers: [
            {
                answer: "تَرعَوْنَ أنعامَكم",
                t: 1,
            },
            {
                answer: "تَأكُلُون مِنه",
                t: 0,
            },
            {
                answer: "تَستظِلونَ بِه",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "النحل",
    },
    {
        id: 2,
        q: "تَقديمُ المَجرورِ في قولِه تَعالَى: {لَهُ الْأَسْمَاءُ الْحُسْنَى}",
        link: "https://dorar.net/tafseer/20/1",
        answers: [
            {
                answer: "للاختِصاصِ",
                t: 1,
            },
            {
                answer: "للعُمومِ",
                t: 0,
            },
            {
                answer: "للتَّقريرِ",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "طه",
    },
    {
        id: 18,
        q: "ممَّا لا يُشتَرَطُ في صِحَّةِ اللِّعانِ: ",
        link: "https://www.dorar.net/feqhia/4912",
        answers: [
            {
                answer: "أنْ تُكَذِّبَ المَرأةُ الرَّجُلَ في قَذْفِه، ويَستَمِرَّ تَكذيبُها له",
                t: 0,
            },
            {
                answer: "أنْ يَكونَ بَينَ زَوجَيْنِ مُكَلَّفَيْنِ",
                t: 0,
            },
            {
                answer: "البَصَرُ",
                t: 1,
            },
        ],
        category: "الفقه",
        topic: "اللعان والعدة",
    },
    {
        id: 1,
        q: "قَولُه تَعالَى: {وَنَزَّلْنَا عَلَيْكُمُ الْمَنَّ وَالسَّلْوَى} أصْلُ «مَنَن»:",
        link: "https://dorar.net/tafseer/20/10",
        answers: [
            {
                answer: "ما يَنبُت في الأَرضِ",
                t: 0,
            },
            {
                answer: "اصطِناعُ خَيْرٍ",
                t: 1,
            },
            {
                answer: "تَذكيرُ الغَيرِ النِّعمةَ",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "طه",
    },
    {
        id: 20,
        q: "يُشرَعُ استِلامُ الحَجَرِ الأسوَدِ بقَصدِ:",
        link: "https://dorar.net/hadith/sharh/35539",
        answers: [
            {
                answer: "تَعظيمِه وتَقديسِه",
                t: 0,
            },
            {
                answer: "التأسِّي بعُمرَ بنِ الخطَّابِ رضي الله عنه",
                t: 0,
            },
            {
                answer: "الإخلاصِ والتَّعبُّدِ للهِ عزَّ وجلَّ",
                t: 1,
            },
        ],
        category: "الحديث",
        topic: "الاختبار السابع",
    },
    {
        id: 7,
        q: "معنى (عَليم) في قولِه تعالى: {إِنَّا نُبَشِّرُكَ بِغُلَامٍ عَلِيمٍ}:",
        link: "https://www.dorar.net/tafseer/15/7 ",
        answers: [
            {
                answer: "عَليمٌ بأُمور الدُّنيا",
                t: 0,
            },
            {
                answer: "عالمٌ بالغيْب بوَحيٍ مِن الله",
                t: 0,
            },
            {
                answer: "غَزيرُ العِلم بالشَّريعة الإلهيَّةِ",
                t: 1,
            },
        ],
        category: "التفسير",
        topic: "الحجر",
    },
    {
        id: 3,
        q: "يأتي اسمُ الفاعِلِ مِنَ الثُّلاثيِّ وغيرِ الثُّلاثيِّ بِشَرطِ أنْ يكونَ",
        link: "https://dorar.net/arabia/1131",
        answers: [
            {
                answer: "ساكن الوسط",
                t: 0,
            },
            {
                answer: "مَبنيًّا للمَعْلومِ",
                t: 1,
            },
            {
                answer: "اسما مشتقا",
                t: 0,
            },
        ],
        category: "اللغة العربية",
        topic: "الصرف",
    },
    {
        id: 18,
        q: "في قولِه تعالى: {إِنَّ أَوَّلَ بَيْتٍ وُضِعَ لِلنَّاسِ لَلَّذِي بِبَكَّةَ} المقصودُ بـ(بَكَّةَ):",
        link: "https://dorar.net/tafseer/3/31#tt7",
        answers: [
            {
                answer: "مَكَّةُ",
                t: 1,
            },
            {
                answer: "المَدينَةُ",
                t: 0,
            },
            {
                answer: "بَيتُ المَقدِسِ",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "آل عمران",
    },
    {
        id: 14,
        q: "ذكرت السورةُ الكريمةُ عقبَ أخبارِ الأنبياءِ المقصودَ الأساسيَّ مِن رسالتِهم، وهذا المقصودُ هُو:",
        link: "https://www.dorar.net/tafseer/21",
        answers: [
            {
                answer: "دعوةُ الناسِ إلى إِصلاحِ مَعاشِهمِ في الحياةِ الدُّنيا",
                t: 0,
            },
            {
                answer: "دعوةُ الناسِ جميعًا إِلى إخلاصِ العبادةِ للهِ",
                t: 1,
            },
            {
                answer: "إِتمامُ مَكارِمِ الأَخلاقِ",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "الأنبياء",
    },
    {
        id: 19,
        q: "سببُ افتِتاحِ سورةِ البَقرةِ بالحُروفِ المقطَّعةِ هو:",
        link: "https://www.dorar.net/tafseer/2/1#tt4",
        answers: [
            {
                answer: "بَيانُ عَجزِ المُشركينَ عن تَكذيبِ القُرآنِ رغمَ أنَّه نزلَ بلُغتهِم",
                t: 0,
            },
            {
                answer: "بَيانُ أنَّ القرآنَ نَزلَ بهذه الحُروفِ العَربيةِ",
                t: 0,
            },
            {
                answer: "بَيانُ إعجازِ القرآنِ؛ حيث تُظهِرُ عجْزَ الخَلْقِ عن مُعارضتِه بمثلِه، مع أنَّه مركَّبٌ من هذه الحروفِ العربيَّةِ التي يتحدَّثونَ بها",
                t: 1,
            },
        ],
        category: "التفسير",
        topic: "البقرة",
    },
    {
        id: 15,
        q: "هو كلُّ مالٍ حَظَرَ الشَّارِعُ اقتناءَه، أو الانتفاعَ به، سواءٌ كان لحُرمَتِه لِذاتِه، بما فيه من ضَرَرٍ أو خَبَثٍ:",
        link: "http://host1.octal.com.sa/feqhia/2111",
        answers: [
            {
                answer: "مال اليَتيم",
                t: 0,
            },
            {
                answer: "المال الحَرام",
                t: 1,
            },
            {
                answer: "المال الضِّمار",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "الزكاة",
    },
    {
        id: 6,
        q: "العِبْرة بالمَكان الذي يُقوِّم فيه التاجِرُ عُروضَه التِّجاريَّة  ",
        link: "http://host1.octal.com.sa/feqhia/2196",
        answers: [
            {
                answer: "مَكانِ المالِ لا المالِكِ",
                t: 1,
            },
            {
                answer: "مَكان المالِك لا المال",
                t: 0,
            },
            {
                answer: "يُحدِّد ذلك القاضي",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "الزكاة",
    },
    {
        id: 20,
        q: "إذا تسبَّبت المرأةُ في الفُرقةِ بعْد الدخولِ:",
        link: "https://www.dorar.net/feqhia/4616/المطلب-الثاني:-الفرقة-بالطَّلاق-بسبب-من-قبل-الزوجة-بعد-الدخول",
        answers: [
            {
                answer: "لا يَسقُط المهرُ",
                t: 1,
            },
            {
                answer: "يَسقُط نصفُ المهر",
                t: 0,
            },
            {
                answer: "يَسقُط المهرُ عن الزَّوج",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "الطلاق",
    },
    {
        id: 17,
        q: 'جاء التَّعبيرُ القُرآنيُّ في قَولِه تَعالَى: {كَانَتَا رَتْقًا} فقال: {كَانَتَا} ولم يقل: "كُنَّ"؛ وذلك أنَّ المرادَ:',
        link: "https://www.dorar.net/tafseer/21/6",
        answers: [
            {
                answer: "السَّمَواتُ السَّبْعُ",
                t: 0,
            },
            {
                answer: "السَّمَاءُ الدُّنيا ",
                t: 0,
            },
            {
                answer: "جماعةُ السَّمَوات وجماعةُ الأرضِ",
                t: 1,
            },
        ],
        category: "التفسير",
        topic: "الأنبياء",
    },
    {
        id: 7,
        q: "قال جِبريلُ للنبيِّ صلَّى اللهُ عليه وسلَّم في شأنِها: فإذا أتتْكَ فاقْرأْ عليها السلامَ من ربِّها ومنِّي، وبشِّرْها ببيتٍ في الجنةِ من قصبٍ لا صَخَبَ فيه ولا نَصَبَ. ",
        link: "https://cutt.us/YCa1T ",
        answers: [
            {
                answer: "خديجةُ بنتُ خوَيلدٍ",
                t: 1,
            },
            {
                answer: "عائشةُ بنتُ أبي بكرٍ",
                t: 0,
            },
            {
                answer: "سَوْدةُ بنتُ زَمْعةَ",
                t: 0,
            },
        ],
        category: "التاريخ",
        topic: "العهد النبوي",
    },
    {
        id: 19,
        q: "قولُه: {قُلِ اللهُ يُفْتِيكُمْ} فيه تقديمُ المسنَدِ إليه (اللهُ) تعالى؛ والغرضُ منه:",
        link: "https://dorar.net/tafseer/4/45#tt9",
        answers: [
            {
                answer: "الاهتمامِ والقَصرِ",
                t: 0,
            },
            {
                answer: "القصرُ فقطْ",
                t: 0,
            },
            {
                answer: "الاهتمامِ، لا القَصرِ",
                t: 1,
            },
        ],
        category: "التفسير",
        topic: "النساء",
    },
    {
        id: 8,
        q: "رحَل إلى رسولِ اللهِ صلَّى اللهُ عليه وسلَّم من يَثربَ في بيعةِ العَقَبةِ الثانيةِ:",
        link: "https://cutt.us/EfU1u ",
        answers: [
            {
                answer: "سبعونَ رَجلًا",
                t: 1,
            },
            {
                answer: "أربعونَ رَجلًا",
                t: 0,
            },
            {
                answer: "خمسونَ رَجلًا",
                t: 0,
            },
        ],
        category: "التاريخ",
        topic: "العهد النبوي",
    },
    {
        id: 1,
        q: "دَعا إبراهيمُ ربَّه أنْ يَجعَلَ مكَّةَ:",
        link: "https://www.dorar.net/tafseer/14/10 ",
        answers: [
            {
                answer: "بلَدًا آمِنًا",
                t: 1,
            },
            {
                answer: "بلَدًا ثَرِيًّا",
                t: 0,
            },
            {
                answer: "بَلدًا واسعًا",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "إبراهيم",
    },
    {
        id: 20,
        q: "قال اللَّهُ تعالى: {وَمَا يَنطِقُ عَنِ الْهَوَى إِنْ هُوَ إِلَّا وَحْيٌ يُوحَى} فالسُّنَّةُ النَّبَويَّةُ جُزءٌ من الوَحيِ. قال السَّمعانيُّ: كُلُّ ما ثَبَتَ بالسُّنَّةِ:",
        link: "https://dorar.net/aqeeda/3129",
        answers: [
            {
                answer: "كان وَحْيًا مِن الله",
                t: 0,
            },
            {
                answer: "فكَأنَّه ثابِتٌ في الكِتابِ",
                t: 1,
            },
            {
                answer: "فهو قُرآنٌ",
                t: 0,
            },
        ],
        category: "العقيدة",
        topic: "لزوم الجماعة وذم البدع",
    },
    {
        id: 5,
        q: "قَوله: {لَهُمْ دَرَجَاتٌ عِنْدَ رَبِّهِمْ}، تَنوين (دَرَجاتٌ):",
        link: "https://dorar.net/tafseer/8/1",
        answers: [
            {
                answer: "لِلتأكيدِ",
                t: 0,
            },
            {
                answer: "لِلتَّعظيمِ",
                t: 1,
            },
            {
                answer: "لِلتَّعريفِ",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "الأنفال",
    },
    {
        id: 16,
        q: "التَّعبيرُ بالقُعودِ في قَولِ اللهِ تعالى: {وَاقْعُدُوا لَهُمْ كُلَّ مَرْصَدٍ}:",
        link: "https://dorar.net/tafseer/9/3#tt17",
        answers: [
            {
                answer: "للإرشادِ إلى الاختِباءِ والتَّخَفِّي",
                t: 0,
            },
            {
                answer: "للإرشادِ إلى التَّأنِّي",
                t: 1,
            },
            {
                answer: "للإرشادِ إلى الاستِقرارِ",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "التوبة",
    },
    {
        id: 5,
        q: "مَعنى الحرَجِ في قَولِه تَعالَى: {فَلاَ يَكُن فِي صَدْرِكَ حَرَجٌ مِّنْهُ}:",
        link: "https: //www.dorar.net/tafseer/7/1",
        answers: [
            {
                answer: "الضِّيقُ",
                t: 1,
            },
            {
                answer: "اليَأسُ",
                t: 0,
            },
            {
                answer: "الحُزنُ",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "الأعراف",
    },
    {
        id: 4,
        q: "دلَّ قولُه تَعالَى: {فَلَا نُقِيمُ لَهُمْ يَوْمَ الْقِيَامَةِ وَزْنًا}:",
        link: "https://www.dorar.net/tafseer/18/26",
        answers: [
            {
                answer: "أنَّ الكافرَ لا يُوزَن عَمَلُه يومَ القِيامَة",
                t: 0,
            },
            {
                answer: "أنَّ الوَزنَ يومَ القِيامَة خاصٌّ بالأَعمالِ فقط",
                t: 0,
            },
            {
                answer: "أنَّ الكافِرَ يُوزَن مع عملِه",
                t: 1,
            },
        ],
        category: "التفسير",
        topic: "الكهف",
    },
    {
        id: 19,
        q: "في افْتِتاحِ القُرآنِ بسورةِ الفاتحةِ",
        link: "https://dorar.net/tafseer/1#tt1",
        answers: [
            {
                answer: "مُشاكَلةٌ",
                t: 0,
            },
            {
                answer: "بَراعةُ استِهْلالٍ",
                t: 1,
            },
            {
                answer: "طِباقٌ",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "الفاتحة",
    },
    {
        id: 2,
        q: "أثَّرَت محاولةُ اغْتيالِ الرئيسِ مبارك على العَلاقاتِ:",
        link: "https://www.dorar.net/history/?page=281",
        answers: [
            {
                answer: "المصريةِ الإثيوبيةِ",
                t: 0,
            },
            {
                answer: "المصريةِ السودانيةِ",
                t: 1,
            },
            {
                answer: "المصريةِ الصوماليةِ",
                t: 0,
            },
        ],
        category: "التاريخ",
        topic: "التاريخ المعاصر",
    },
    {
        id: 1,
        q: "لو تَصرَّفَتِ الزَّوجةُ بأكثَرَ من ثُلُثِ مالِها بالهِبةِ",
        link: "https://www.dorar.net/feqhia/6614",
        answers: [
            {
                answer: "صَحَّ تَصَرُّفُها",
                t: 1,
            },
            {
                answer: "بَطَلَتِ الهِبةُ",
                t: 0,
            },
            {
                answer: "للزَّوجِ مَنْعُ الكُلِّ أو إجازَتُه",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "الهبات",
    },
    {
        id: 17,
        q: "فاءُ (فأتَتْ) في قولِه تعالى: {فَأَتَتْ بِهِ قَوْمَهَا تَحْمِلُهُ قَالُوا يَا مَرْيَمُ لَقَدْ جِئْتِ شَيْئًا فَرِيًّا} فيها دلالةٌ على أنَّ مَريمَ:",
        link: "https://www.dorar.net/tafseer/19/6#tt18",
        answers: [
            {
                answer: "جاءت أهْلَها ليكلِّمَهم ابنُها",
                t: 0,
            },
            {
                answer: "جاءت أهْلَها عَقِب انتهاءِ الكلامِ الذي كلَّمها ابنُها",
                t: 1,
            },
            {
                answer: "أخذَت معها زكريَّا ليكلِّم أهْلَها",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "مريم",
    },
    {
        id: 14,
        q: "في قولِه تعالى: {اللَّهُ لَا إِلَهَ إِلَّا  هُوَ الْحَيُّ الْقَيُّومُ}:",
        link: "https://dorar.net/tafseer/3/1#tt7",
        answers: [
            {
                answer: "رَدٌّ على المجوس",
                t: 0,
            },
            {
                answer: "ردٌّ على المشركين وعلى النَّصارى خاصَّة",
                t: 1,
            },
            {
                answer: "رَدٌّ على المُشرِكينَ الذين قالو: إنَّ محمدًا ساحِرٌ",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "آل عمران",
    },
    {
        id: 13,
        q: "الزَّبُورُ هو الكِتابُ المُنزَّلُ على:",
        link: "https://dorar.net/tafseer/4/42#tt7",
        answers: [
            {
                answer: "عيسى عليه السلامُ",
                t: 0,
            },
            {
                answer: "إِلياسَ عليه السلامُ",
                t: 0,
            },
            {
                answer: "داودَ عليه السلامُ",
                t: 1,
            },
        ],
        category: "التفسير",
        topic: "النساء",
    },
    {
        id: 6,
        q: "معنى كلمةِ (البالغةُ) في قولِه تَعالَى: {قُلْ فَلِلَّهِ الْحُجَّةُ الْبَالِغَةُ}:",
        link: " https: //www.dorar.net/tafseer/6/39",
        answers: [
            {
                answer: "التي تبلُغُ مُرادَه في ثُبوتِها على مَنِ احتجَّ بها عَليهِ من خَلقِه",
                t: 1,
            },
            {
                answer: "التي بلَغَت حدَّ الإعْجازِ في البَلاغةِ",
                t: 0,
            },
            {
                answer: "التي بلَّغَها الأنْبياءُ لأقْوامِهم",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "الأنعام",
    },
    {
        id: 16,
        q: "وُقوعُ (لا) بينَ المنِّ والأذى في قولِه تعالى: (مَنًّا وَلَا أَذًى):",
        link: "https://www.dorar.net/tafseer/2/45#tt18",
        answers: [
            {
                answer: "لتَبيِين أنَّ المَنَّ أَحدُ أَنواعِ الأذَى",
                t: 0,
            },
            {
                answer: "لشمولِ النفيِ كلًّا منهما، وليس كونَهما مجتمِعَينِ فقطْ",
                t: 1,
            },
            {
                answer: "للإطنابِ",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "البقرة",
    },
    {
        id: 18,
        q: 'قوله تعالى: {فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ} "فاطِر" أي: ',
        link: "https://dorar.net/tafseer/39/13",
        answers: [
            {
                answer: "قاهِر",
                t: 0,
            },
            {
                answer: "خالِق ومُبدِع",
                t: 1,
            },
            {
                answer: "مَالِك وسَيِّد",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "الزمر",
    },
    {
        id: 12,
        q: "كلمة رَمَضان وشَعْبان ممنوعة من الصرف لأنها:",
        link: "https://dorar.net/arabia/244",
        answers: [
            {
                answer: "أشهر متتابعة",
                t: 0,
            },
            {
                answer: "تنتهي بحرف النون",
                t: 0,
            },
            {
                answer: "عَلَمِيَّة مع زيادةِ الأَلِفِ والنُّونِ",
                t: 1,
            },
        ],
        category: "اللغة العربية",
        topic: "النحو",
    },
    {
        id: 7,
        q: "دلَّ قولُه تَعالَى: {وَالَّذِينَ كَذَّبُواْ بِآيَاتِنَا يَمَسُّهُمُ الْعَذَابُ} على:",
        link: "https: //www.dorar.net/tafseer/6/13",
        answers: [
            {
                answer: "أنَّ العَذابَ في الآخرةِ عَذابٌ مَعنَوِيٌّ؛ لقولِه: (يَمَسُّهُمُ الْعَذَابُ)",
                t: 0,
            },
            {
                answer: "أنَّ التكذيبَ بآياتِ اللهِ سببٌ للعقوبةِ في الدُّنيا والآخِرةِ",
                t: 1,
            },
            {
                answer: "أنَّ آياتِ الله عزَّ وجلَّ نَزلَت لتَثبِيت الرُّسلِ عليهم السَّلامُ",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "الأنعام",
    },
    {
        id: 7,
        q: "العُروضُ غَيرُ المُعَدَّةِ لِلتِّجارة ",
        link: "http://host1.octal.com.sa/feqhia/2169",
        answers: [
            {
                answer: "لا زَكاةَ فيها",
                t: 1,
            },
            {
                answer: "يُكرَه فيها الزَّكاة",
                t: 0,
            },
            {
                answer: "تَجِب فيها الزَّكاة",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "الزكاة",
    },
    {
        id: 8,
        q: "أصدرَتِ الحكومةُ التركيةُ برئاسةِ مصطفى كمال أتاتورك قرارًا حكوميًّا سنةَ 1353هـ 1934م بتوقُّفِ الصلاةِ في:",
        link: "https://www.dorar.net/history/?page=255",
        answers: [
            {
                answer: "جامعِ الفاتِحِ",
                t: 0,
            },
            {
                answer: "جامعِ أيوب سُلطان",
                t: 0,
            },
            {
                answer: "جامِعِ آيا صُوفْيا",
                t: 1,
            },
        ],
        category: "التاريخ",
        topic: "التاريخ المعاصر",
    },
    {
        id: 8,
        q: "مِن المَعصُومِينَ مِن فِتنةِ القَبرِ وعَذابِه:",
        link: "https://dorar.net/aqeeda/1730",
        answers: [
            {
                answer: "مَن ماتَ بداءِ البَطنِ",
                t: 1,
            },
            {
                answer: "مَن ماتَت وزَوجُها عنها راضٍ",
                t: 0,
            },
            {
                answer: "مَن أَحصَى أَسماءَ الله تعالى",
                t: 0,
            },
        ],
        category: "العقيدة",
        topic: "الإيمان باليوم الآخر",
    },
    {
        id: 16,
        q: "التَّوحيدُ الذي اجتَمعَت عَليهِ الخَلائقُ مُؤمِنُها وكافِرُها",
        link: "https://dorar.net/aqeeda/212",
        answers: [
            {
                answer: "تَوحيدُ الأسماءِ والصِّفاتِ",
                t: 0,
            },
            {
                answer: "تَوحيدُ الأُلوهيَّةِ",
                t: 0,
            },
            {
                answer: "تَوحيدُ الرُّبوبيَّةِ",
                t: 1,
            },
        ],
        category: "العقيدة",
        topic: "توحيد الربوبية",
    },
    {
        id: 11,
        q: "كيفيَّةُ تَقويم زَكاة عُروض التِّجارة، وما يُقوَّمُ مِن مَوجودات التاجِر في زَكاة عُروض التِّجارة",
        link: "http://host1.octal.com.sa/feqhia/2186",
        answers: [
            {
                answer: "كلُّ ما مَلَكَه التَّاجِرُ بقَصدِ بَيْعِه",
                t: 1,
            },
            {
                answer: "كلُّ ما مَلَكَه التَّاجِرُ مُطلقًا",
                t: 0,
            },
            {
                answer: "ما حالَ عليهِ الحَولِ مِن النَّقدَينِ فقط",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "الزكاة",
    },
    {
        id: 6,
        q: "الهِبةُ للأولادِ",
        link: "https://www.dorar.net/feqhia/6671",
        answers: [
            {
                answer: "تُكرَهُ",
                t: 0,
            },
            {
                answer: "تَجوزُ",
                t: 1,
            },
            {
                answer: "لا تَجوزُ",
                t: 0,
            },
        ],
        category: "الفقه",
        topic: "الهبات",
    },
    {
        id: 19,
        q: "في قَولِه تَعاَلى:    {أَتُتْرَكُونَ فِي مَا هَا هُنَا آَمِنِينَ}:",
        link: "https://dorar.net/tafseer/26/10",
        answers: [
            {
                answer: "دَليلٌ على عدمِ البقاءِ في حالِ الرَّفاهيَةِ عِقابًا لِمَنِ الْتَزَموا شِركَهم",
                t: 1,
            },
            {
                answer: "بَيانُ أَمرِ استِقرارِهِم في غَفلتِهم",
                t: 0,
            },
            {
                answer: "استِفهامٌ حقيقيٌّ على بَقائهِم في مَوطِنِهمُ الَّذي يَسكُنونه",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "الشعراء",
    },
    {
        id: 4,
        q: "يجوزُ في جَمعِ (مُنْطَلِق): مَطالِق، و: ",
        link: "https://dorar.net/arabia/1228",
        answers: [
            {
                answer: "مُنطالِيق",
                t: 0,
            },
            {
                answer: "مَطالِيق",
                t: 1,
            },
            {
                answer: "طَوالِيق",
                t: 0,
            },
        ],
        category: "اللغة العربية",
        topic: "الصرف",
    },
    {
        id: 12,
        q: "مِن أَقسامِ الحُروفِ التي تَشترِكُ فيها الأسماءُ والأَفعالُ:",
        link: "https://dorar.net/arabia/27",
        answers: [
            {
                answer: "الحُروفُ المُتشابِهَةِ",
                t: 0,
            },
            {
                answer: "حُروفُ القَسَمِ",
                t: 0,
            },
            {
                answer: "حُروفُ العَطفِ",
                t: 1,
            },
        ],
        category: "اللغة العربية",
        topic: "النحو",
    },
    {
        id: 14,
        q: "أفادَ الاستفهامُ في قولِه تَعالَى: {وَمَا لَكُمْ أَلَّا تَأْكُلُواْ مِمَّا ذُكِرَ اسْمُ اللَّهِ عَلَيْهِ}:",
        link: "https: //www.dorar.net/tafseer/6/31",
        answers: [
            {
                answer: "التَّقريرَ والتَّوبيخَ",
                t: 0,
            },
            {
                answer: "الإنكارَ على مَنِ امتنَعَ من ذلك",
                t: 1,
            },
            {
                answer: "الإنكارَ على مَن فعَلَ ذلك",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "الأنعام",
    },
    {
        id: 10,
        q: "وَطءُ المُظاهِرِ قبلَ أداءِ الكَفَّارةِ إذا كان تَكفيرُه بالإطعامِ",
        link: "https://www.dorar.net/feqhia/4882",
        answers: [
            {
                answer: "يَجوزُ",
                t: 0,
            },
            {
                answer: "مَكروهٌ",
                t: 0,
            },
            {
                answer: "حَرامٌ",
                t: 1,
            },
        ],
        category: "الفقه",
        topic: "الخلع والإيلاء",
    },
    {
        id: 1,
        q: "الرَّبْوةُ في قولِه تعالى: {كَمَثَلِ جَنَّةٍ بِرَبْوَةٍ} هي:",
        link: "https://www.dorar.net/tafseer/2/45#tt7",
        answers: [
            {
                answer: "المكانُ المرتفِعُ منَ الأرضِ",
                t: 1,
            },
            {
                answer: "المكانُ المظلِمُ منَ الخارجِ",
                t: 0,
            },
            {
                answer: "الأرضُ الواسِعةُ المُنبسِطَة",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "البقرة",
    },
    {
        id: 20,
        q: "نَهى النَّبيُّ ﷺ في الحَديثِ عنِ اشتِمالِ الصَّمَّاءِ لأنَّ فيه تَشبُّهًا بـ:",
        link: "https://dorar.net/hadith/sharh/7710",
        answers: [
            {
                answer: "اليَهودِ",
                t: 1,
            },
            {
                answer: "النَّصارَى",
                t: 0,
            },
            {
                answer: "المَجوسِ",
                t: 0,
            },
        ],
        category: "الحديث",
        topic: "الاختبار السادس",
    },
    {
        id: 3,
        q: "معنى {مُعَقِّبَاتٌ} في قَوله تَعالَى: {لَهُ مُعَقِّبَاتٌ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ}:",
        link: "https://dorar.net/tafseer/13/3",
        answers: [
            {
                answer: "لِلعَبدِ مَلائِكة يَتَعاقَبونَ عليه",
                t: 1,
            },
            {
                answer: "لِلعَبدِ أعمال مُتَعاقِبة",
                t: 0,
            },
            {
                answer: "العَبد يُعاقَبُ على أخطائِه",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "الرعد",
    },
    {
        id: 2,
        q: "قولُه تعالى: {غَافِرِ الذَّنْبِ وَقَابِلِ التَّوْبِ شَدِيدِ الْعِقَابِ} يُقرَنُ هذان الوصْفانِ كثيرًا في مواضعَ متعدِّدةٍ مِن القرآنِ:",
        link: "https://dorar.net/tafseer/40/1",
        answers: [
            {
                answer: "ليبقَى العبدُ بيْنَ الرَّجاءِ والخَوفِ",
                t: 1,
            },
            {
                answer: "لنَصْبِ مِيزانِ العَدلِ بين مَغفِرَةِ الذُّنوبِ وشِدَّةِ العِقابِ",
                t: 0,
            },
            {
                answer: "لأنَّ فيه رَدًّا على المُرجِئَةِ الذين يقُولونَ: إنَّ صِفاتِ الله كلُّها مَجازِيَّهٌ",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "غافر",
    },
    {
        id: 5,
        q: "المُخاطَب بقَولِه تَعالَى: {فَاصْبِرْ إِنَّ الْعَاقِبَةَ لِلْمُتَّقِينَ}:",
        link: " https://www.dorar.net/tafseer/11/11",
        answers: [
            {
                answer: "هود عليه السَّلامُ",
                t: 0,
            },
            {
                answer: "مُحَمَّد صلَّى الله عليه وسلَّم",
                t: 1,
            },
            {
                answer: "نوح عليه السَّلامُ",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "هود",
    },
    {
        id: 11,
        q: "بسببِ إقْدامِها على الاعترافِ بدولةِ إسرائيلَ قامتْ جامعةُ الدولِ العربيةِ بفَرضِ مُقاطعةٍ اقتصاديةٍ على:",
        link: "https://www.dorar.net/history/?page=264",
        answers: [
            {
                answer: "المملكةِ الأُردنيةِ",
                t: 0,
            },
            {
                answer: "دولةِ إيرانَ",
                t: 1,
            },
            {
                answer: "دولةِ تُركيا",
                t: 0,
            },
        ],
        category: "التاريخ",
        topic: "التاريخ المعاصر",
    },
    {
        id: 7,
        q: "مَعنَى قَولِه تَعالَى: {صَاغِرُونَ}:",
        link: "https://www.dorar.net/tafseer/27/5",
        answers: [
            {
                answer: "حَجْمُهُم ضَئيلٌ",
                t: 0,
            },
            {
                answer: "عاجِزون أذِلَّاءُ",
                t: 1,
            },
            {
                answer: "ذَوُو بُكاءٍ ونَحِيبٍ",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "النمل",
    },
    {
        id: 7,
        q: "مَن مات عَلى الشِّركِ",
        link: "https://www.dorar.net/aqeeda/2989",
        answers: [
            {
                answer: "يَدخُلُ النَّارَ بقَدرِ شِركِه ثمَّ يَخرُجُ",
                t: 0,
            },
            {
                answer: "أمْرُه إلى اللهِ إنْ شاءَ عَذَّبَه وإنْ شاءَ غَفَر له",
                t: 0,
            },
            {
                answer: "يَحبَطُ عَملُه، ويُخلَّدُ في النَّارِ",
                t: 1,
            },
        ],
        category: "العقيدة",
        topic: "الشرك وأقسامه",
    },
    {
        id: 9,
        q: "يقولُ النبيُّ ﷺ: إخْوَانُكُمْ خَوَلُكُمْ، جَعَلَهُمُ اللَّهُ:",
        link: "https://dorar.net/hadith/sharh/5976",
        answers: [
            {
                answer: "تَحْتَ أيْدِيكُمْ",
                t: 1,
            },
            {
                answer: "مِن مَتاعِكم",
                t: 0,
            },
            {
                answer: "عَونًا لكُم",
                t: 0,
            },
        ],
        category: "الحديث",
        topic: "الاختبار الثاني",
    },
    {
        id: 2,
        q: "الأصلُ في مُضارِع كلمة (فَعِلَ)",
        link: "https://dorar.net/arabia/1039",
        answers: [
            {
                answer: "الضَّمُّ (يَفْعُل)",
                t: 0,
            },
            {
                answer: "الفَتحُ (يَفْعَل)",
                t: 1,
            },
            {
                answer: "الكَسرُ (يَفْعِل)",
                t: 0,
            },
        ],
        category: "اللغة العربية",
        topic: "الصرف",
    },
    {
        id: 18,
        q: "مَعرِفةُ اللهِ بالقَلبِ",
        link: "https://www.dorar.net/aqeeda/413",
        answers: [
            {
                answer: "تَزيدُ بمَعرِفةِ تَفاصيلِ الأسماءِ والصِّفاتِ، وبزِيادةِ الأدِلَّةِ على الوَحدانيَّةِ",
                t: 1,
            },
            {
                answer: "لا تَزيدُ، ولا تَنقُصُ",
                t: 0,
            },
            {
                answer: "تَزيدُ بالطَّاعةِ، وتَنقُصُ بالمَعصيةِ",
                t: 0,
            },
        ],
        category: "العقيدة",
        topic: "توحيد الأسماء والصفات",
    },
    {
        id: 2,
        q: "فِي إثباتِ النِّداءِ في قَولِه تَعاَلى: {وَإِذْ نَادَى رَبُّكَ} دليلٌ على:",
        link: "https://www.dorar.net/tafseer/26/2",
        answers: [
            {
                answer: "أنَّ كَلامَ اللهِ تَعالَى يكون بصوتٍ وحروفٍ",
                t: 1,
            },
            {
                answer: "أنَّ اللهَ تعالى يتكلَّمُ لا بحرفٍ ولا بصوتٍ",
                t: 0,
            },
            {
                answer: "إِثباتُ اسمِ المُنادَي للهِ عزَّ وجلَّ",
                t: 0,
            },
        ],
        category: "التفسير",
        topic: "الشعراء",
    },
];

export default dailyQuestions;
